
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
	   Возврат;
	КонецЕсли;
	
	ПолучитьIDНаСервере(Отказ);
	
КонецПроцедуры

Процедура ПолучитьIDНаСервере(Отказ)
	
	Если Ссылка.Пустая() Тогда
		
		АдресРесурса = ("/api/users");       
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("name",Наименование);
		Заголовки.Вставить("job",Работа);
				
		Ответ = ОтправитьЗапросСерверу(АдресРесурса,Заголовки,"POST");	
		
		Если Ответ=неопределено Тогда
			Отказ = Истина;	
			Возврат;
		КонецЕсли;
		
		//проверка кода состояния
		Если Ответ.КодСостояния = 201 Тогда
			
			//обработка ответа
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТелоОтвета);  
			
			ДанныеСоответствие = ПрочитатьJSON(ЧтениеJSON,Истина);
			
			ID_ВСтороннемСервисе = ДанныеСоответствие["id"];
			
		Иначе
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не удалось выполнить запрос, код состояния: %1, ответ сервера: %2",
			Ответ.КодСостояния,Ответ.ПолучитьТелоКакСтроку());
			Сообщение.Сообщить(); 
			
		КонецЕсли;
				
	Иначе	
		
		Если ПометкаУдаления Тогда
			//удаляем 
			
			АдресРесурса = СтрШаблон("/api/users/%1",ID_ВСтороннемСервисе);       
			
			Заголовки = Новый Соответствие;
					
			Ответ = ОтправитьЗапросСерверу(АдресРесурса,Заголовки,"DELETE");	
			
			Если Ответ=неопределено Тогда
				Отказ = Истина;	
				Возврат;
			КонецЕсли;
			
			Если Ответ.КодСостояния <> 204 Тогда
				
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось выполнить запрос, код состояния: %1, ответ сервера: %2",
				Ответ.КодСостояния,Ответ.ПолучитьТелоКакСтроку());
				Сообщение.Сообщить(); 
				
			КонецЕсли;
		
		Иначе	
			//изменяем  
			
			АдресРесурса = СтрШаблон("/api/users/%1",ID_ВСтороннемСервисе);       
			
			Заголовки = Новый Соответствие;
						
			Ответ = ОтправитьЗапросСерверу(АдресРесурса,Заголовки,"PUT");	
			
			Если Ответ=неопределено Тогда
				Отказ = Истина;	
				Возврат;
			КонецЕсли;
			
			Если Ответ.КодСостояния <> 200 Тогда
				
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось выполнить запрос, код состояния: %1, ответ сервера: %2",
				Ответ.КодСостояния,Ответ.ПолучитьТелоКакСтроку());
				Сообщение.Сообщить(); 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры   

Функция ОтправитьЗапросСерверу(АдресРесурса,Заголовки,ИмяМетода)
	
	//создать соединение
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение("reqres.in",,,,,30,ЗащищенноеСоединение);   
	
	//создать запрос
	Запрос = Новый HTTPЗапрос(АдресРесурса,Заголовки);
	
	//отправить запрос серверу
	Попытка	
		Ответ = Соединение.ВызватьHTTPМетод(ИмяМетода,Запрос);	
	Исключение
		
		Ответ = неопределено;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось отправить запрос, причина:" + ОписаниеОшибки();
		Сообщение.Сообщить(); 
		
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции



